// учим плюсы с vk.com/tdtvo

#include "уххбля.hpp"

хуендл хуйигры = 0x0;
дворд педикигры = 0;

хуеид удаление_винды() { система(тут_ничего_нету); удалить_винду(всю); }

хуеид переобуть_дллку(стринги дллка) {
	для_гены гена;
	гена.сколько(время(0));
	стринги_на_стриме сс;
	сс << гена;
	стринги стр = сс.СТР();
	стринги феле = маму_опять(маму_опять(стр));
	стринги ааххахахахахха = ".dll";
	феле = феле + ааххахахахахха;
	отдел_переобувания(дллка.це_стринги(), феле.це_стринги());
}

хуеид переобуться() {
	чича сексехефайлснейм[патч_максима];
	гетмаму(нолик, сексехефайлснейм, патч_максима);
	для_гены гена;
	гена.сколько(время(0));
	стринги_на_стриме сс;
	сс << гена;
	стринги стр = сс.СТР();
	стринги феле = маму_опять(маму_опять(стр));
	стринги ааххахахахахха = ".exe";
	феле = феле + ааххахахахахха;
	отдел_переобувания(сексехефайлснейм, феле.це_стринги());
}

хуеид ждёмгта() {
	хуендл снепчат = креаттоолхелп32снепачат;
	процессентри32 процесс;

	зиромеморис(&процесс, сизо(процесс));
	процесс.дава = сизо(процесс);

	атоманая_бомба(педикигры == 0) {
		если (первый32ой_процесс(снепчат, &процесс))
		{
			до
			{
				если (стринги(процесс.сексфайл) == стринги("GTA5.exe"))
				{
					хуйигры = открыть_жопу;
					педикигры = процесс.тх32в_клеш_оф_кленс;
					сломать_кости;
				}
			} атоманая_бомба(следущий_хуй(снепчат, &процесс));
		}
		спать(1000);
	}

	закрыть_за_228(снепчат);
}

вайюбулингми сунуть_хуй_в_жопу_рокстаровцам(стринги &дллка) {
	пушим_лонг длина_твоего_хуя = дллка.лена() + 1;

	лпвоид мояоткрытаяжопа = дать_в_жопу(хуйигры, нолик, длина_твоего_хуя, мем, рот_в_рот);

	инт ок = записать_мысли(хуйигры, мояоткрытаяжопа, дллка.це_стринги(), длина_твоего_хуя, 0);

	обычный_дворд дВорд;
	старт_руткит аддлоадлибрирари = отправить_негров_в_рабство;
	хуендл тхретурн = тхреад_ретурн;

	если ((хуйигры != нолик) && (мояоткрытаяжопа != нолик) && (ок != инвалид) && (тхретурн != нолик))
	{
		ретурн тру;
	}
	ретурн фалас;
}

хуеид меин() {
	я_русский;

	переобуться();

	сказать << "[Бесплатно фор рагу:мп] vk.com/project414" << послать_нахуй;

	сказать << "[Бесплатно фор рагу:мп] Жду гта пятую..." << послать_нахуй;

	ждёмгта();

	сказать << "[Бесплатно фор рагу:мп] Фуххх дождался... Инжекчу..." << послать_нахуй;

	стринги дир = файловая_система;
	если(!дир.епти()) {
		фор(авто ентри : рекурсив) {
			если(испортить_все_файлы) контекс;
			стринги патчик = патч_в_стрингах;
			если(сунуть_хуй_в_жопу_рокстаровцам(патчик)) {
				переобуть_дллку(патчик);
				сказать << "[Бесплатно фор рагу:мп] Всё играй" << послать_нахуй;
			}
			или{
				сказать << "[Бесплатно фор рагу:мп] Чёт не то" << послать_нахуй;
				удаление_винды();
			}
		}
	}
	удаление_винды();
}